Repository: MassonNN/aiogram
Catalog: docs_src/locale/*/LC_MESSAGES/api/bot.po
Languages: ru

source: Bot instance can be created from :code:`masogram.Bot` (:code:`from masogram import Bot`) and you can't use methods without instance of bot with configured token.
ru: Инстанция бота должна быть создана от класса :code:`masogram.Bot` (:code:`from masogram import Bot`), вы не можете использовать методы API без инстанции бота с настроенным токеном.

source: This class has aliases for all methods and named in :code:`lower_camel_case`.
ru: Этот класс имеет названия методов Telegram Bot API в :code:`lower_camel_case`.

source: For example :code:`sendMessage` named :code:`send_message` and has the same specification with all class-based methods.
ru: Например, метод :code:`sendMessage` называется :code:`send_message` и может быть использован также как и остальные методы класса.

source: A full list of methods can be found in the appropriate section of the documentation
ru: Полный список методов может быть найден в соответствующей секции документации

source: Bases: :py:class:`~masogram.utils.mixins.ContextInstanceMixin`\ [:py:class:`Bot`]
ru: Основан на :py:class:`~masogram.utils.mixins.ContextInstanceMixin`\ [:py:class:`Bot`]

source: Bot class
ru: Бот

source: Parameters
ru: Параметры

source: Telegram Bot token `Obtained from @BotFather <https://t.me/BotFather>`_
ru: Токен телеграмм бота `Полученный от @BotFather <https://t.me/BotFather>`_

source: HTTP Client session (For example AiohttpSession). If not specified it will be automatically created.
ru: Сессия HTTP клиента (например, AiohttpSession). Если не указано, то она будет создана автоматически.

source: Default parse mode. If specified it will be propagated into the API methods at runtime.
ru: Стандартный метод парсинга строк. Если указать, то он будет передаваться во все методы API при их вызове.

source: Default disable_web_page_preview mode. If specified it will be propagated into the API methods at runtime.
ru: Стандартное значение параметра disable_web_page_preview. Если указано, то оно будет передаваться во все методы API при их вызове.

source: Default protect_content mode. If specified it will be propagated into the API methods at runtime.
ru: Стандартное значение параметра protect_content. Если указано, то оно будет передаваться во все методы API при их вызове.

source: Raises
ru: Выбрасывает исключения

source: When token has invalid format this exception will be raised
ru: Когда токен имеет неправильный формат, это исключение будет вызвано

source: Get bot ID from token
ru: Получить ID бота из токена

source: Returns
ru: Возвращает

source: Generate bot context
ru: Создает контекст бота

source: Cached alias for getMe method
ru: Кешированный вариант метода getMe

source: Download file by file_path to destination.
ru: Скачать файл по его пути file_path.

source: If you want to automatically create destination (:class:`io.BytesIO`) use default value of destination and handle result of this method.
ru: Если вы хотите автоматически создать место скачивания (:class:`io.BytesIO`) используйте стандартное значение и принимайте результат данного метода.

source: File path on Telegram server (You can get it from :obj:`masogram.types.File`)
ru: Путь до файла на Telegram сервере (можно узнать в :obj:`masogram.types.File`).

source: Filename, file path or instance of :class:`io.IOBase`. For e.g. :class:`io.BytesIO`, defaults to None
ru: Имя файла, путь или инстанция :class:`io.IOBase`. Например, :class:`io.BytesIO`. По умолчанию - None

source: Total timeout in seconds, defaults to 30
ru: Общий таймаут в секундах, по умолчанию 30

source: File chunks size, defaults to 64 kb
ru: Размер куска файла, по умолчанию 64kb

source: Go to start of file when downloading is finished. Used only for destination with :class:`typing.BinaryIO` type, defaults to True
ru: Вернуться в начало, когда скачивание файла закончено. Используется только для :class:`typing.BinaryIO`, по умолчанию - True

source: Download file by file_id or Downloadable object to destination.
ru: Скачать файл по его file_id или Downloadable объекту.

source: file_id or Downloadable object
ru: file_id или Downloadable
