Repository: MassonNN/aiogram
Catalog: docs_src/locale/*/LC_MESSAGES/api/download_file.po
Languages: ru

source: How to download file?
ru: Как скачать файл?

source: Download file manually
ru: Скачать файл вручную

source: First, you must get the `file_id` of the file you want to download. Information about files sent to the bot is contained in `Message <types/message.html>`__.
ru: Во-первых, вы должны получить `file_id` файла, который хотите скачать. Информация о файлах, отправленных боту, содержится в `Message <types/message.html>`__.

source: For example, download the document that came to the bot.
ru: Например, скачать документ, который пришел боту.

source: Then use the `getFile <methods/get_file.html>`__ method to get `file_path`.
ru: Затем используйте метод `getFile <methods/get_file.html>`__, чтобы получить `file_path`.

source: After that, use the `download_file <#download-file>`__ method from the bot object.
ru: После этого используйте метод `download_file <#download-file>`__ из объекта бота.

source: download_file(...)
ru: Загрузка файла(...)

source: Download file by `file_path` to destination.
ru: Загрузите файл по `file_path` в пункт назначения.

source: If you want to automatically create destination (:obj:`io.BytesIO`) use default value of destination and handle result of this method.
ru: Если вы хотите автоматически создать место назначения (:obj:`io.BytesIO`), используйте значение по умолчанию для места назначения и обработайте результат этого метода.

source: Download file by file_path to destination.
ru: Скачать файл по пути_файла к месту назначения.

source: If you want to automatically create destination (:class:`io.BytesIO`) use default value of destination and handle result of this method.
ru: Если вы хотите автоматически создать место назначения (:class:`io.BytesIO`), используйте значение по умолчанию для места назначения и обработайте результат этого метода.

source: Parameters
ru: Параметры

source: File path on Telegram server (You can get it from :obj:`masogram.types.File`)
ru: Путь к файлу на сервере Telegram (вы можете получить его из :obj:`masogram.types.File`)

source: Filename, file path or instance of :class:`io.IOBase`. For e.g. :class:`io.BytesIO`, defaults to None
ru: Имя файла, путь к файлу или экземпляр :class:`io.IOBase`. Например, :class:`io.BytesIO`, по умолчанию None

source: Total timeout in seconds, defaults to 30
ru: Общее время ожидания в секундах, по умолчанию 30

source: File chunks size, defaults to 64 kb
ru: Размер кусков файла, по умолчанию 64 КБ

source: Go to start of file when downloading is finished. Used only for destination with :class:`typing.BinaryIO` type, defaults to True
ru: Перейти к началу файла после завершения загрузки. Используется только для назначения с типом :class:`typing.BinaryIO`, по умолчанию True

source: There are two options where you can download the file: to **disk** or to **binary I/O object**.
ru: Существует два варианта загрузки файла: **на диск** или в **двоичный объект ввода-вывода**.

source: Download file to disk
ru: Скачать файл на диск

source: To download file to disk, you must specify the file name or path where to download the file. In this case, the function will return nothing.
ru: Для загрузки файла на диск необходимо указать имя файла или путь, по которому следует скачать файл. В этом случае функция ничего не вернет.

source: Download file to binary I/O object
ru: Загрузить файл в двоичный объект ввода/вывода

source: To download file to binary I/O object, you must specify an object with the :obj:`typing.BinaryIO` type or use the default (:obj:`None`) value.
ru: Чтобы загрузить файл в двоичный объект ввода-вывода, вы должны указать объект с типом :obj:`typing.BinaryIO` или использовать значение по умолчанию (:obj:`None`).

source: In the first case, the function will return your object:
ru: В первом случае функция вернет ваш объект:

source: If you leave the default value, an :obj:`io.BytesIO` object will be created and returned.
ru: Если вы оставите значение по умолчанию, будет создан и возвращен объект :obj:`io.BytesIO`.

source: Download file in short way
ru: Скачать файл коротким путем

source: Getting `file_path` manually every time is boring, so you should use the `download <#download>`__ method.
ru: Получать `file_path` вручную каждый раз скучно, поэтому вам следует использовать метод `download <#download>`__.

source: download(...)
ru: скачать(...)

source: Download file by `file_id` or `Downloadable` object to destination.
ru: Загрузите файл по `file_id` или объекту `Downloadable` в место назначения.

source: Download file by file_id or Downloadable object to destination.
ru: Скачать файл по file_id или загружаемому объекту в место назначения.

source: file_id or Downloadable object
ru: file_id или загружаемый объект

source: It differs from `download_file <#download-file>`__ **only** in that it accepts `file_id` or an `Downloadable` object (object that contains the `file_id` attribute) instead of `file_path`.
ru: Он отличается от `download_file <#download-file>`__ **только** тем, что принимает `file_id` или объект `Downloadable` (объект, который содержит атрибут `file_id`) вместо `file_path`.

source: You can download a file to `disk <#download-file-to-disk>`__ or to a `binary I/O <#download-file-to-binary-io-object>`__ object in the same way.
ru: Вы можете загрузить файл на `диск <#download-file-to-disk>`__ или в объект `binary I/O <#download-file-to-binary-io-object>`__ таким же образом.

source: Example:
ru: Пример:
